app/controllers/post_tests_controller.rb

SELECT `post_tests`.* FROM `post_tests`
---
  def index
    @post_tests = PostTest.all

INSERT INTO `post_tests` (`created_at`, `pass`, `updated_at`, `user`) VALUES (?, ?, ?, ?)  [["created_at", Fri, 06 Sep 2013 03:39:24 UTC +00:00], ["pass", "ttnguyenit1@gmail.com"], ["updated_at", Fri, 06 Sep 2013 03:39:24 UTC +00:00], ["user", "My Account"]]
---
  def create
    @post_test = PostTest.new(post_test_params)
    #@test="abcd"
    respond_to do |format|
      if @post_test.save

DELETE FROM `post_tests` WHERE `post_tests`.`id` = ?  [["id", 6]]
---
  def destroy
    @post_test.destroy

SELECT `post_tests`.* FROM `post_tests` WHERE `post_tests`.`id` = ? LIMIT 1  [["id", "9"]]
---
    def set_post_test
      @post_test = PostTest.find(params[:id])